/**********************************

菱形是一种特殊的平行四边形，是四条边均相等的平行四边形。题目给出菱形的边长n，用*画出菱形。如n=1，输出: 

*
n=2，输出: 

 *
*** 
 * 
n=3，输出: 

  * 
 ***
*****
 ***
  *
那么，你能用程序来实现么?

输入格式:
输入菱形的边长n，1<n<100。

输出格式:
输出对应的用*表示的菱形。

输入样例:
4

输出样例:
    *
   ***
  *****
 *******
  *****
   ***
    *


***********************************/

#include<stdio.h>

int main(void) {
    int n;
    scanf("%d", &n);
    // 上半部分
    for (int i = 1; i <= n; i++) {
        for (int j = 1; j <= n - i; j++) {
            printf(" ");
        }
        for (int k = 1; k <= 2 * i - 1; k++) {
            printf("*");
        }
        printf("\n");
    }
    // 下半部分
    for (int i = n - 1; i >= 1; i--) {
        for (int j = 1; j <= n - i; j++) {
            printf(" ");
        }
        for (int k = 1; k <= 2 * i - 1; k++) {
            printf("*");
        }
        printf("\n");
    }
    return 0;
}