/**********************************

输入两个3位的正整数m，n，输出[m,n]区间内所有的“水仙花数”。所谓“水仙花数”是指一个3位数，其各位数字的立方和等于该数本身。

输入格式:
测试数据有多组，处理到文件尾。每组测试输入两个3位的正整数m,n(100≤m<n≤999)。

输出格式:
对于每组测试，若[m，n]区间内没有水仙花数则输出none，否则逐行输出区间内所有的水仙花数，每行输出的格式具体参看输出样例。

输入样例:
100 150
100 200

输出样例:
none
153=1*1*1+5*5*5+3*3*3

***********************************/

#include <stdio.h>

int main() {
    int i, j, k, b, m, n;
    int found = 0;

    while (scanf("%d %d", &m, &n)!= EOF) {
        found = 0;  //init
        for (b = m; b <= n; b++) {
            i = b / 100;
            j = (b / 10) % 10;
            k = b % 10;

            if (i*i*i + j*j*j + k*k*k == b) {
                printf("%d=%d*%d*%d+%d*%d*%d+%d*%d*%d\n", b, i, i, i, j, j, j, k, k, k);
                found = 1;
            }
        }
        if (!found) {
            printf("none\n");
        }
    }

return 0;
}
