/**********************************

有一个10个单元的整型数组，输入10个整数，数组下标为奇数的单元加2，下标偶数的单元乘2，最后求和

输入格式:
输入10个整数，空格分隔

输出格式:
处理后输出10个整数的和

输入样例:
1 2 3 4 5 6 7 8 9 10

输出样例:
在这里给出相应的输出。例如：
sum = 90

***********************************/

#include <stdio.h>

int main(void) {
    int arr[10], sum = 0;
    for(int i = 0; i < 10; i++){
        scanf("%d", &arr[i]);
        if(i % 2 == 0)  //偶数
            arr[i] *= 2;
        else
            arr[i] += 2;
        sum += arr[i];
    }
    printf("sum = %d", sum);
}