/**********************************

假设个人所得税为：税率×(工资−1600)。请编写程序计算应缴的所得税，其中税率定义为：

当工资不超过1600时，税率为0；
当工资在区间(1600, 2500]时，税率为5%；
当工资在区间(2500, 3500]时，税率为10%；
当工资在区间(3500, 4500]时，税率为15%；
当工资超过4500时，税率为20%。

输入格式:
输入在一行中给出非负工资。

输出格式:
在一行输出个人所得税，精确到小数点后2位。

***********************************/

#include <stdio.h>

int main() {
    double wage, tax = 0.0;
    scanf("%lf", &wage);

    if (wage <= 1600) {
        tax = 0;
    } else if (wage <= 2500) {
        tax = (wage - 1600) * 0.05;
    } else if (wage <= 3500) {
        tax = (wage - 1600) * 0.1;
    } else if (wage <= 4500) {
        tax = (wage - 1600) * 0.15;
    } else {
        tax = (wage - 1600) * 0.2;
    }

    printf("%.2f", tax);
    
return 0;
}